In [1]:
from sqlalchemy import create_engine
import pandas as pd

In [13]:
engine = create_engine('mysql+pymysql://root:detgonz1289@localhost:3306/sales')

In [7]:
bases = engine.execute('show databases;')

In [9]:
bases.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('pubs',),
 ('sakila',),
 ('sales',),
 ('sys',),
 ('world',)]

In [14]:
res = engine.execute("""select * from product;""")

In [15]:
res.fetchall()

[('1', 'Nail', Decimal('10.00'), datetime.date(2013, 3, 31)),
 ('2', 'Washer', Decimal('15.00'), datetime.date(2013, 3, 29)),
 ('3', 'Nut', Decimal('14.25'), datetime.date(2013, 3, 29)),
 ('4', 'Screw', Decimal('25.00'), datetime.date(2013, 3, 30)),
 ('5', 'Super_Nut', Decimal('30.00'), datetime.date(2013, 3, 30)),
 ('6', 'New Nut', None, None)]

In [16]:
res = pd.read_sql('select * from product;', engine)
res

  p_code     p_name  price   launch_dt
0      1       Nail  10.00  2013-03-31
1      2     Washer  15.00  2013-03-29
2      3        Nut  14.25  2013-03-29
3      4      Screw  25.00  2013-03-30
4      5  Super_Nut  30.00  2013-03-30
5      6    New Nut    NaN        None